
########################################################
# 分辨率配置
#
WINDOW_WIDTH = 800
DEVICE_WIDTH = 3200
# 游戏窗口宽度（画布宽） / 设备屏幕真实宽度(屏幕分辨率)
RATE = WINDOW_WIDTH / DEVICE_WIDTH
#
########################################################


########################################################
# 小地图房间识别识别配置
#
# 小地图中心点坐标（蓝色小人）
CENTER_POINT = (2954, 174)
# 小地图中心点距相邻房间中心点距离（=房间直径）
OFFSET_ROOM = 77
# 小地图中心点距地图绿色小箭头中心点距离
OFFSET_ARROW = 53
#
########################################################


########################################################
# 卡位补救措施
#
# 卡位超时时间：毫秒
#（超过这个时间无法进门会被判断为卡位，并执行补救措施）
BLOCKER_TIME_OUT = 5000
#
########################################################


